In [1]:
# !pip install numpy

In [2]:
import pandas as pd
import numpy as np

In [3]:
pd.__version__

'2.2.1'

In [31]:
titanic_df = pd.read_csv('Titanic_data.csv', nrows=100)

## DataFrame Exploration

In [32]:
titanic_df.shape

(100, 12)

In [33]:
titanic_df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [34]:
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [35]:
titanic_df.tail(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
98,99,1,2,"Doling, Mrs. John T (Ada Julia Bone)",female,34.0,0,1,231919,23.0,NaN,S
99,100,0,2,"Kantor, Mr. Sinai",male,34.0,1,0,244367,26.0,NaN,S

In [36]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  100 non-null    int64
 1   Survived     100 non-null    int64
 2   Pclass       100 non-null    int64
 3   Name         100 non-null    object
 4   Sex          100 non-null    object
 5   Age          78 non-null     float64
 6   SibSp        100 non-null    int64
 7   Parch        100 non-null    int64
 8   Ticket       100 non-null    object
 9   Fare         100 non-null    float64
 10  Cabin        20 non-null     object
 11  Embarked     99 non-null     object
dtypes: float64(2), int64(5), object(5)
memory usage: 9.5+ KB

In [37]:
titanic_df[['Age']].describe()

             Age
count  78.000000
mean   27.465769
std    15.278878
min     0.830000
25%    18.250000
50%    26.000000
75%    34.750000
max    71.000000

- Average age is 27 which suggest most of the passenger are young people.
- Mean nearly equal to Median , suggesting a symmetrical distribution.

In [38]:
titanic_df[['Age','Fare']].describe()

             Age        Fare
count  78.000000  100.000000
mean   27.465769   29.517625
std    15.278878   40.972905
min     0.830000    7.225000
25%    18.250000    8.050000
50%    26.000000   15.675000
75%    34.750000   32.134375
max    71.000000  263.000000

In [39]:
# df.value_counts()
titanic_df.value_counts("Sex", normalize=True)

Sex
male      0.61
female    0.39
Name: proportion, dtype: float64

In [40]:
titanic_df[titanic_df["Sex"] == "male"].value_counts("Survived", ascending=False)

Survived
0    51
1    10
Name: count, dtype: int64

In [41]:
titanic_df[titanic_df["Sex"] == "female"].value_counts("Survived", ascending=False)

Survived
1    31
0     8
Name: count, dtype: int64

In [42]:
titanic_df.value_counts(["Sex", "Survived"])

Sex     Survived
male    0           51
female  1           31
male    1           10
female  0            8
Name: count, dtype: int64

In [43]:
# unique()
# nunique()

titanic_df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [44]:
titanic_df['Embarked'].nunique()

3

In [45]:
# isna() or isnull()
titanic_df.isna().sum()

PassengerId     0
Survived        0
Pclass          0
Name            0
Sex             0
Age            22
SibSp           0
Parch           0
Ticket          0
Fare            0
Cabin          80
Embarked        1
dtype: int64

In [46]:
titanic_df [titanic_df['Cabin'].notna()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
31,32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,NaN,1,0,PC 17569,146.5208,B78,C
52,53,1,1,"Harper, Mrs. Henry Sleeper (Myna Haxtun)",female,49.0,1,0,PC 17572,76.7292,D33,C
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C
55,56,1,1,"Woolner, Mr. Hugh",male,NaN,0,0,19947,35.5000,C52,S
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0000,B28,NaN
62,63,0,1,"Harris, Mr. Henry Birkhardt",male,45.0,1,0,36973,83.4750,C83,S
66,67,1,2,"Nye, Mrs. (Elizabeth Ramell)",female,29.0,0,0,C.A. 29395,10.5000,F33,S
75,76,0,3,"Moen, Mr. Sigurd Hansen",male,25.0,0,0,348123,7.6500,F G73,S
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0000,C23 C25 C27,S
92,93,0,1,"Chaffee, Mr. Herbert Fuller",male,46.0,1,0,W.E.P. 5734,61.1750,E31,S
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
97,98,1,1,"Greenfield, Mr. William Bertram",male,23.0,0,1,PC 17759,63.3583,D10 D12,C

---

In [ ]:
# groupby()

In [47]:
group_by_sex = titanic_df[['Sex','Fare']].groupby(
    by = "Sex"
)

In [48]:
group_by_sex.sum()

             Fare
Sex
female  1242.1251
male    1709.6374

In [49]:
group_by_sex.mean()

             Fare
Sex
female  31.849362
male    28.026843

In [53]:
group_by_embark = titanic_df[['Embarked','Fare','Age']].groupby(
    by = "Embarked"
)

In [54]:
group_by_embark.mean()

               Fare        Age
Embarked
C         36.687700  32.423077
Q         11.128711  12.000000
S         29.002354  26.997213

In [56]:
# Correlation
titanic_df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [59]:
titanic_df[['Survived', "Pclass", "Age",'Fare']].corr()

          Survived    Pclass       Age      Fare
Survived  1.000000 -0.185200 -0.058001  0.074624
Pclass   -0.185200  1.000000 -0.472514 -0.584589
Age      -0.058001 -0.472514  1.000000  0.054499
Fare      0.074624 -0.584589  0.054499  1.000000